01_test_cases/01_2D-Diffusion_1phase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (5 0 0)
    (5 5 0)
    (0 5 0)
    (0 0 0.01)
    (5 0 0.01)
    (5 5 0.01)
    (0 5 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type empty;
        faces
        (
            (1 5 4 0)
        );
    }
    
    top
    {
        type empty;
        faces
        (
            (3 7 6 2)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (2 6 5 1)
            (0 4 7 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
