01_test_cases/01_2D-Diffusion_1phase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue C 0
);

regions
(
    cylinderToCell
    {
        point1      (2.5 2.5 -0.1);
        point2      (2.5 2.5 0.1);
        radius      0.5;

        fieldValues
        (
    	    volScalarFieldValue C 1
        );
    }
);


// ************************************************************************* //
